================================================================================
basic record
================================================================================

a = { a: unit, b: unit }

--------------------------------------------------------------------------------

(purescript
  (function
    name: (variable)
    rhs: (exp_record
      (exp_field
        (exp_field_name
          (variable))
        (exp_name
          (variable)))
      (comma)
      (exp_field
        (exp_field_name
          (variable))
        (exp_name
          (variable))))))

================================================================================
record with quoted fields 
================================================================================

a = { "a": unit, "B": unit }

--------------------------------------------------------------------------------

(purescript
  (function
    name: (variable)
    rhs: (exp_record
      (exp_field
        (exp_field_quoted_name
          (string))
        (exp_name
          (variable)))
      (comma)
      (exp_field
        (exp_field_quoted_name
          (string))
        (exp_name
          (variable))))))

================================================================================
record updates 
================================================================================

a = a { a = 1 }

--------------------------------------------------------------------------------

(purescript
  (function
    name: (variable)
    rhs: (exp_record_mutation
      (variable)
      (exp_field_assignment
        (exp_field_name
          (variable))
        (exp_literal
          (integer))))))

================================================================================
qualified record updates 
================================================================================

a = A.a { a = 1 }

--------------------------------------------------------------------------------

(purescript
  (function
    name: (variable)
    rhs: (exp_record_mutation
      (qualified_variable
        (module)
        (variable))
      (exp_field_assignment
        (exp_field_name
          (variable))
        (exp_literal
          (integer))))))

================================================================================
type-level record syntax 
================================================================================

a :: { a :: Unit, b :: Unit }

--------------------------------------------------------------------------------

(purescript
  (signature
    name: (variable)
    type: (record_fields
      (field
        (field_name)
        (type_name
          (type)))
      (comma)
      (field
        (field_name)
        (type_name
          (type))))))

================================================================================
type-level record syntax with quoted fields 
================================================================================

a :: { a :: Unit, "B" :: Unit }

--------------------------------------------------------------------------------

(purescript
  (signature
    name: (variable)
    type: (record_fields
      (field
        (field_name)
        (type_name
          (type)))
      (comma)
      (field
        (field_quoted_name)
        (type_name
          (type))))))

